ci4/app/Controllers/Artikel.php

    public function admin_index()
    {
        $title = 'Daftar Artikel (Admin)';
        $model = new ArtikelModel();

        $q = $this->request->getVar('q') ?? '';
        $kategori_id = $this->request->getVar('kategori_id') ?? '';
        $page = $this->request->getVar('page') ?? 1;

        $builder = $model->table('artikel')
            ->select('artikel.*, kategori.nama_kategori')
            ->join('kategori', 'kategori.id_kategori = artikel.id_kategori');

        if ($q !== '') {
            $builder->like('artikel.judul', $q);
        }

        if ($kategori_id !== '') {
            $builder->where('artikel.id_kategori', $kategori_id);
        }

        $artikel = $builder->paginate(10, 'default', $page);
---
SELECT COUNT(*) AS `numrows`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
 LIMIT 10

            return $this->response->setJSON($data);
        } else {
            $kategoriModel = new KategoriModel();
            $data['kategori'] = $kategoriModel->findAll();
---
SELECT *
FROM `kategori`

    public function add()
    {
        $validationRules = [
            'judul'       => 'required',
            'id_kategori' => 'required|integer',
            'gambar'      => [
                'label' => 'Gambar',
                'rules' => 'is_image[gambar]|mime_in[gambar,image/jpg,image/jpeg,image/png]|max_size[gambar,2048]', // max 2MB
                'errors' => [
                    'is_image' => 'File yang diunggah harus gambar.',
                    'mime_in'  => 'Gambar harus berformat jpg, jpeg, atau png.',
                    'max_size' => 'Ukuran gambar maksimal 2MB.'
                ]
            ]
        ];

        if ($this->request->getMethod() == 'POST' && $this->validate($validationRules)) {
            $model = new ArtikelModel();

            // Tangani file gambar
            $gambar = $this->request->getFile('gambar');
            $namaGambar = null;

            if ($gambar && $gambar->isValid() && !$gambar->hasMoved()) {
                $namaGambar = $gambar->getRandomName(); // nama acak agar aman
                $gambar->move('uploads/artikel', $namaGambar); // Pastikan folder ini ada
            }

            // Simpan ke database
            $model->insert([
                'judul'       => $this->request->getPost('judul'),
                'isi'         => $this->request->getPost('isi'),
                'slug'        => url_title($this->request->getPost('judul'), '-', true),
                'id_kategori' => $this->request->getPost('id_kategori'),
                'gambar'      => $namaGambar // pastikan field ini ada di DB
            ]);
---
INSERT INTO `artikel` (`judul`, `isi`, `slug`, `id_kategori`, `gambar`) VALUES ('Danantara Ambil Dana $3 Miliar dari Kredit Multinasional', 'Danantara Indonesia, sovereign wealth fund negara, menarik dana awal sebesar US$3 miliar dari fasilitas kredit senilai US$10 miliar yang disediakan oleh lima bank asing: DBS, HSBC, Natixis, Standard Chartered, dan UOB. Ini menjadi pinjaman swasta terbesar di Asia Tenggara bila seluruh dana dicairkan. Dana tersebut akan mendukung proyek seperti pabrik chlor-alkali dan ethylene dichloride milik Chandra Asri Pacific senilai US$800 juta, serta investasi bersama dana kekayaan negara Qatar dan China. Pinjaman ini menggunakan suku bunga setara obligasi pemerintah Indonesia tanpa jaminan negara, dengan tenor tiga tahun .\r\n\r\nInisiatif ini menunjukkan tekad Indonesia, melalui Danantara, untuk mengakselerasi pertumbuhan ekonomi dan mencapai target 8% pertumbuhan, lebih tinggi dari saat ini yang berada di sekitar 5%.', 'danantara-ambil-dana-3-miliar-dari-kredit-multinasional', '4', NULL)

            $kategoriModel = new KategoriModel();
            $data = [
                'title'    => 'Tambah Artikel',
                'kategori' => $kategoriModel->findAll(),
---
SELECT *
FROM `kategori`

    public function delete($id)
        {
            $artikel = new ArtikelModel();
            // Hapus file gambar terkait sebelum menghapus data dari database
            $dataArtikel = $artikel->find($id);
            if ($dataArtikel && $dataArtikel['gambar'] && file_exists(ROOTPATH . 'public/gambar/' . $dataArtikel['gambar'])) {
                unlink(ROOTPATH . 'public/gambar/' . $dataArtikel['gambar']);
            }
            $artikel->delete($id);
---
SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '2'
DELETE FROM `artikel`
WHERE `id` IN ('2')

    public function view($slug)
    {
        $artikelModel = new ArtikelModel();
        $kategoriModel = new KategoriModel();

        $data['artikel'] = $artikelModel->where('slug', $slug)->first();
        if (empty($data['artikel'])) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Artikel tidak ditemukan.');
        }

        $data['title'] = $data['artikel']['judul'];

        // Tambahkan data untuk sidebar
        $artikelModel->orderBy('id', 'DESC')->limit(5)->find();

        $data['kategori'] = $kategoriModel->findAll();
---
SELECT *
FROM `artikel`
WHERE `slug` = 'danantara-ambil-dana-3-miliar-dari-kredit-multinasional'
 LIMIT 1
SELECT *
FROM `artikel`
ORDER BY `id` DESC
 LIMIT 5
SELECT *
FROM `kategori`